Revit 2023 API
BuiltInFailures.AnalyticalModelFailures.NoAnalyticalElemensLeftInExistingRelationship Property
 There are no Analytical elements left in the existing relationship.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static FailureDefinitionId NoAnalyticalElemensLeftInExistingRelationship { get; }
Visual Basic
Public Shared ReadOnly Property NoAnalyticalElemensLeftInExistingRelationship As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoAnalyticalElemensLeftInExistingRelationship {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace